Figure_18/zfs_qat_test/silesia_chunk_4kread_lat_test/latency_res/09_29-09_55/nocomp/8K/out_09_29-10_00_28.txt
#############################################################
align: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.35-118-g4a0c76
Starting 1 process

align: (groupid=0, jobs=1): err= 0: pid=32253: Sun Sep 29 10:01:35 2024
  read: IOPS=5801, BW=22.7MiB/s (23.8MB/s)(1513MiB/66743msec)
    clat (usec): min=4, max=1158, avg=87.49, stdev=35.89
     lat (usec): min=4, max=1158, avg=87.51, stdev=35.90
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   63], 10.00th=[   64], 20.00th=[   67],
     | 30.00th=[   70], 40.00th=[   73], 50.00th=[   78], 60.00th=[   88],
     | 70.00th=[   93], 80.00th=[   99], 90.00th=[  109], 95.00th=[  128],
     | 99.00th=[  281], 99.50th=[  302], 99.90th=[  355], 99.95th=[  392],
     | 99.99th=[  594]
   bw (  KiB/s): min= 6451, max=30192, per=100.00%, avg=23227.71, stdev=3676.95, samples=133
   iops        : min= 1612, max= 7548, avg=5806.92, stdev=919.27, samples=133
  lat (usec)   : 10=0.13%, 20=0.01%, 50=0.08%, 100=81.92%, 250=16.52%
  lat (usec)   : 500=1.33%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=49.23%, sys=10.52%, ctx=400042, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=100.0%, 4=0.1%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=387238,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=22.7MiB/s (23.8MB/s), 22.7MiB/s-22.7MiB/s (23.8MB/s-23.8MB/s), io=1513MiB (1586MB), run=66743-66743msec
 
zfs_prefetch_disable: 1
zfs_arc_max_val: 0
zfs_arc_min_val: 0
zfs_qat_compress_disable: 
 
compress_type: NAME         PROPERTY     VALUE           SOURCE
mypool/myfs  compression  off             local
 
blocksize: NAME         PROPERTY    VALUE    SOURCE
mypool/myfs  recordsize  8K       local
 
iters: 2
output_path: ./latency_res/09_29-09_55/nocomp/8K