Figure_18/zfs_qat_test/silesia_chunk_4kread_lat_test/latency_res/09_29-09_55/nocomp/8K/out_09_29-10_01_38.txt
#############################################################
align: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.35-118-g4a0c76
Starting 1 process

align: (groupid=0, jobs=1): err= 0: pid=32570: Sun Sep 29 10:02:45 2024
  read: IOPS=5781, BW=22.6MiB/s (23.7MB/s)(1513MiB/66978msec)
    clat (usec): min=4, max=596, avg=87.24, stdev=38.20
     lat (usec): min=4, max=596, avg=87.26, stdev=38.20
    clat percentiles (usec):
     |  1.00th=[   61],  5.00th=[   63], 10.00th=[   64], 20.00th=[   66],
     | 30.00th=[   69], 40.00th=[   72], 50.00th=[   77], 60.00th=[   87],
     | 70.00th=[   92], 80.00th=[   97], 90.00th=[  106], 95.00th=[  147],
     | 99.00th=[  289], 99.50th=[  306], 99.90th=[  367], 99.95th=[  392],
     | 99.99th=[  457]
   bw (  KiB/s): min= 6408, max=29792, per=100.00%, avg=23155.25, stdev=3745.94, samples=133
   iops        : min= 1602, max= 7448, avg=5788.81, stdev=936.49, samples=133
  lat (usec)   : 10=0.13%, 20=0.01%, 50=0.07%, 100=84.13%, 250=13.88%
  lat (usec)   : 500=1.79%, 750=0.01%
  cpu          : usr=49.52%, sys=10.33%, ctx=400331, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=100.0%, 4=0.1%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=387238,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=22.6MiB/s (23.7MB/s), 22.6MiB/s-22.6MiB/s (23.7MB/s-23.7MB/s), io=1513MiB (1586MB), run=66978-66978msec
 
zfs_prefetch_disable: 1
zfs_arc_max_val: 0
zfs_arc_min_val: 0
zfs_qat_compress_disable: 
 
compress_type: NAME         PROPERTY     VALUE           SOURCE
mypool/myfs  compression  off             local
 
blocksize: NAME         PROPERTY    VALUE    SOURCE
mypool/myfs  recordsize  8K       local
 
iters: 2
output_path: ./latency_res/09_29-09_55/nocomp/8K